app/controllers/recipes_controller.rb

	def index
		@recipe = Recipe.all.order("created_at DESC")
---
SELECT "recipes".* FROM "recipes"   ORDER BY created_at DESC

	def create
		@recipe = current_user.recipes.build(recipe_params)

		if @recipe.save
---
INSERT INTO "recipes" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-06-06 01:43:31.945352"], ["description", "Всё о моём первом рецепте и только о рецепте!"], ["title", "Мой первый рецепт"], ["updated_at", "2015-06-06 01:43:31.945352"]]

  def update
  	if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "image_content_type" = ?, "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "recipes"."id" = 2  [["image_content_type", "image/jpeg"], ["image_file_name", "200.jpg"], ["image_file_size", 79042], ["image_updated_at", "2015-06-06 02:38:23.022963"], ["updated_at", "2015-06-06 02:38:23.209429"]]